package day06.review;

import java.util.Scanner;

/**
 * 우리학원에서 박희진님께서 거액의 예산을 주고
 * 전제레인지를 구매하라고 지시하셨다.
 * 이 때 전자레인지의 구매비용은 다음과 같이 현금으로 지급한다.
 * 구매비			: 657852 ( 단위: 개 )
 * 50000		: 13
 * 10000		: 0
 * 5000			: 1
 * 1000			: 2
 * 500			: 1
 * 100			: 3
 * 50			: 1
 * 10			: 0
 * 5			: 0
 * 1			: 2
 * 위와 같이 입력하면 큰 화폐단위부터 계산하여 화폐매수를 출력하는 프로그램을 작성하시오.
 * */

public class Ex03_화폐매수 {
	
	public static void main(String[] args) {
		/*
		 	순서도
		 	1. 필요한 변수 선언
		 		- (입력금액), (화폐매수), (화폐단위)
		 	2. 구매비 입력
		 	3. 화폐매수를 계산
		 		3-1.화폐매수 계산
		 			(화폐매수) = (입력금액) / (화폐단위)
		 		3-2. 잔액 계산
		 	 		657852 / 50000 = 13
		 	 		i) (잔액) = (입력금액) - (화폐단위 * 화폐매수)
		 	 		657852 - (50000 * 13) = 7852
		 	 		ii) (잔액) = (입력금액) % (화폐단위)
		 	 		657852 % 50000 = 7852
		 	 	3-3. 화폐 단위 변환
		 	 		번갈아가며 /5, /2 연산을 반복
		 	 		(화폐단위) = (화폐단위) / 5
		 	 		(화폐단위) = (화폐단위) / 2
		 	 4. 3번 과정을 반복
		 	 	* 조건 : 화폐단위가 1원이 될 때까지 반복
		 */
		Scanner sc = new Scanner(System.in);
		System.out.print("구매비 : ");
		int input = sc.nextInt();		// (입력금액)
		int money = 50000;				// (화폐단위)
		int count = 0;					// (화폐매수)
		boolean sw = true;
		
		while(money > 0) {
			// 화폐매수 계산
			// 화폐매수 = 입력금액 / 화폐단위
			count = input / money;
			System.out.println(money + "\t\t : " + count + "개");
		
			// 잔액 = 입력금액 % 화폐단위 
			input = input % money;
			
			if(sw) 
				// 화폐단위 = 화폐단위 / 5
				money = money / 5;
			else
				// 화폐단위 = 화폐단위 / 2
				money = money / 2;
			sw = !sw;
		// 한줄일 경우에만 중괄호 생략가능
			// 두 줄 이상일 경우에는 반드시 중괄호를 포함시켜 주어야 함
		}
		
		sc.close();
	}

}
